In [42]:
import pandas as pd 
import numpy as np

# About Sqlite:
a software library to  provide a relational database management system, which is lightweight in terms of setup, database administration, and required resources.

SQLite has the following noticeable features: self-contained, serverless, zero-configuration, transactional.

In [43]:
import sqlite3

In [46]:

query = """
CREATE TABLE test2
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)

con.commit()

In [45]:
query = """
DROP TABLE test2;"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)

con.commit()

In [20]:

query = """
CREATE TABLE testtry
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata2')
con.execute(query)
con.commit()

In [47]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5),
        ('India', 'Delhi', 2.5, 6)]
stmt = "INSERT INTO test2 VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

## extracting all rows

In [48]:
cursor = con.execute('select * from test2')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('India', 'Delhi', 2.5, 6)]

## extracting column names from description

In [49]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [50]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3        India       Delhi  2.50  6

#fetching selected rows

In [52]:
cursor = con.execute('select * from test2 where a like "India" ')
rows = cursor.fetchall()
rows

[('India', 'Delhi', 2.5, 6)]

## to get all table names created

In [53]:
cursor = con.execute("SELECT name FROM sqlite_master WHERE type='table';")

In [54]:
rows = cursor.fetchall()
rows

[('test',), ('test1',), ('test2',)]

# Another alternative to read your database  mydata.sqlite

In [1]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

ModuleNotFoundError: No module named 'sqlalchemy'

## cannot run directly in visual studio. so use terminal window

In [2]:
!cp mydata.sqlite copied-data

'cp' is not recognized as an internal or external command,
operable program or batch file.

# Accessing data from the copied database

In [16]:
con = sqlite3.connect('copied-data')

In [17]:
cursor = con.execute('select * from test where a like "India" ')
rows = cursor.fetchall()
rows

[]